000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. IMC.
000003     AUTHOR. Fernando Anselmo.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION. 
000009 
000010 01 ALTURA    PIC 9V99.
000011 01 PESO      PIC 999.
000012 01 IMC_TOTAL PIC ZZ9.99.
000013
000014 PROCEDURE DIVISION.
000015 PRINCIPAL.
000016     DISPLAY "Entre com sua altura (em Mt): ".
000017     ACCEPT ALTURA.
000018     DISPLAY "Entre com seu peso (em Kg): ".
000019     ACCEPT PESO.
000020 
000021     COMPUTE IMC_TOTAL = PESO / (ALTURA ** 2).
000022     DISPLAY "Seu IMC é " IMC_TOTAL.
000023 
000024 STOP RUN.
000025 END PROGRAM IMC.
